<?
include 'header.php';
?>
<?php if ( isset ($_SESSION['logged_user']) ) : ?>
<div class="section-2" id="test_cat_block">
    <div class="wrapper">
        <h2 class="cat_tests">Выберите категорию тестов</h2>
        <div class="partners" id="test_cat">
            <div class="partner" data-id="one">
                <svg width="94" height="56" viewBox="0 0 94 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M58.9603 15.0188L58.9581 15.0204C58.9353 15.0366 58.9182 15.0518 58.9156 15.0541L58.9153 15.0544C58.9126 15.0568 58.9101 15.0591 58.908 15.061C58.9057 15.0631 58.9039 15.0648 58.9025 15.0661L58.8885 15.0796L58.862 15.106C58.8421 15.1261 58.8146 15.1541 58.7804 15.1892C58.7118 15.2594 58.6135 15.3607 58.4901 15.4882C58.2431 15.7433 57.8939 16.1051 57.4769 16.5378C56.6428 17.4031 55.5366 18.5526 54.4324 19.7007C53.3283 20.8488 52.226 21.9955 51.3998 22.8551L50.4018 23.8937L50.1223 24.1845L50.0487 24.2612L50.0298 24.2808L50.025 24.2858L50.0238 24.287L50.0235 24.2874C50.0235 24.2874 50.0234 24.2875 50.3557 24.6067L50.0234 24.2875L50.0226 24.2883L49.9932 24.319L49.9873 24.3253L49.9815 24.3317C46.6738 28.0399 40.8301 27.9434 37.6442 24.136C35.5277 21.6057 35.5535 17.9575 37.7058 15.4555C37.7058 15.4555 37.7058 15.4555 37.7059 15.4554L47.4833 4.09311L47.4834 4.093C49.3876 1.87875 52.2219 0.5 55.3278 0.5H62.0914C63.7781 0.500074 65.4454 0.859222 66.9813 1.55331C68.5172 2.24739 69.8862 3.26033 70.9968 4.52414C70.9968 4.52416 70.9968 4.52418 70.9968 4.5242L77.05 11.4148V36.9504H75.2392C75.2016 34.8356 74.4431 32.8588 73.0574 31.3152L61.4171 17.1436C61.7465 16.5024 61.6292 15.6979 61.0823 15.1771C60.4913 14.6135 59.6001 14.569 58.9603 15.0188ZM70.4909 33.4651L70.5003 33.4766L70.5104 33.4875C72.5789 35.7236 72.2008 39.3655 70.1895 41.2295C68.9893 42.3405 67.546 42.7844 66.3332 42.8826C65.7269 42.9317 65.1894 42.8932 64.7837 42.8144C64.5805 42.7749 64.4188 42.727 64.3023 42.6796C64.2043 42.6398 64.162 42.61 64.1518 42.6028C64.1486 42.6006 64.1486 42.6005 64.1508 42.603L63.1271 41.4938L63.2862 42.9948C63.3335 43.4413 63.205 44.0628 62.8647 44.7644C62.5286 45.4574 62.0039 46.1902 61.315 46.8487C59.9382 48.165 57.9392 49.1554 55.5331 48.9797L55.133 48.9505L55.0178 49.3348C54.1614 52.1916 50.6188 54.5953 46.9675 53.3373L46.6729 53.2358L46.452 53.4556C45.0689 54.8318 42.9189 55.5 40.9576 55.5C36.8813 55.5 33.1604 53.8027 30.6612 51.1513L30.6613 51.1512L30.6534 51.1432L16.95 37.2453V10.6991L25.7795 3.45125L25.7981 3.436L25.8151 3.41903C27.691 1.5504 30.2358 0.500168 32.8897 0.5H38.3858C40.554 0.5 42.6277 1.32478 44.1951 2.78589L35.1633 13.2803C31.9428 17.0221 31.9042 22.4892 35.0721 26.2771L35.0722 26.2772C39.5815 31.6664 47.8109 31.7602 52.4646 26.5773L59.135 19.6242L70.4909 33.4651ZM3.525 7.52194H10.575C12.2476 7.52194 13.6 8.87185 13.6 10.5329V40.9613C13.6 42.6224 12.2476 43.9723 10.575 43.9723H3.525C1.85243 43.9723 0.5 42.6224 0.5 40.9613V10.5329C0.5 8.87185 1.85243 7.52194 3.525 7.52194ZM3.6125 37.4504C3.6125 39.3443 5.15336 40.8762 7.05 40.8762C8.94664 40.8762 10.4875 39.3443 10.4875 37.4504C10.4875 35.5564 8.94664 34.0246 7.05 34.0246C5.15336 34.0246 3.6125 35.5564 3.6125 37.4504ZM83.425 7.52194H90.475C92.1476 7.52194 93.5 8.87186 93.5 10.5329V40.9613C93.5 42.6224 92.1476 43.9723 90.475 43.9723H83.425C81.7524 43.9723 80.4 42.6224 80.4 40.9613V10.5329C80.4 8.87186 81.7524 7.52194 83.425 7.52194ZM83.5125 37.4504C83.5125 39.3443 85.0534 40.8762 86.95 40.8762C88.8466 40.8762 90.3875 39.3443 90.3875 37.4504C90.3875 35.5564 88.8466 34.0246 86.95 34.0246C85.0534 34.0246 83.5125 35.5564 83.5125 37.4504Z" fill="black" stroke="black"/>
                </svg>

                <h4>Менталитет</h4>
            </div>
            <div class="partner"  data-id="two">
                <svg width="94" height="47" viewBox="0 0 94 47" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M70.511 0H23.5037C10.5179 0 0 10.5162 0 23.5C0 36.4837 10.5179 47 23.5037 47C30.0847 47 36.0194 44.2975 40.2794 39.95H53.7206C57.9806 44.2975 63.93 47 70.4963 47C83.4821 47 94 36.4837 94 23.5C94 10.5162 83.4968 0 70.511 0ZM37.6059 26.4375C37.6059 27.4069 36.8126 28.2 35.8431 28.2H28.2044V35.8375C28.2044 36.8069 27.4112 37.6 26.4416 37.6H20.5657C19.5962 37.6 18.8029 36.8069 18.8029 35.8375V28.2H11.1642C10.1947 28.2 9.40147 27.4069 9.40147 26.4375V20.5625C9.40147 19.5931 10.1947 18.8 11.1642 18.8H18.8029V11.1625C18.8029 10.1931 19.5962 9.4 20.5657 9.4H26.4416C27.4112 9.4 28.2044 10.1931 28.2044 11.1625V18.8H35.8431C36.8126 18.8 37.6059 19.5931 37.6059 20.5625V26.4375ZM64.6351 36.425C60.7423 36.425 57.584 33.2672 57.584 29.375C57.584 25.4828 60.7423 22.325 64.6351 22.325C68.5279 22.325 71.6862 25.4828 71.6862 29.375C71.6862 33.2672 68.5279 36.425 64.6351 36.425ZM76.3869 24.675C72.4941 24.675 69.3358 21.5172 69.3358 17.625C69.3358 13.7328 72.4941 10.575 76.3869 10.575C80.2797 10.575 83.438 13.7328 83.438 17.625C83.438 21.5172 80.2797 24.675 76.3869 24.675Z" fill="black"/>
                </svg>

                <h4>Развлечения</h4>
            </div>
            <div class="partner"  data-id="three">
                <svg width="56" height="69" viewBox="0 0 56 69" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M27.9865 2.04862C28.0942 2.68202 30.1538 14.7839 30.1538 19.4064C30.1538 26.4546 26.4115 31.4814 20.8788 33.5028L22.6154 65.5904C22.7096 67.4367 21.2423 69 19.3846 69H10.7692C8.925 69 7.44423 67.4502 7.53846 65.5904L9.275 33.5028C3.72885 31.4814 0 26.4411 0 19.4064C0 14.7705 2.05962 2.68202 2.16731 2.04862C2.59808 -0.68711 8.26538 -0.72754 8.61539 2.19687V21.2257C8.79039 21.6839 10.6481 21.657 10.7692 21.2257C10.9577 17.8162 11.8327 2.4664 11.8462 2.11601C12.2904 -0.68711 17.8635 -0.68711 18.2942 2.11601C18.3212 2.47987 19.1827 17.8162 19.3712 21.2257C19.4923 21.657 21.3635 21.6839 21.525 21.2257V2.19687C21.875 -0.714063 27.5558 -0.68711 27.9865 2.04862ZM44.0327 40.5511L42.0135 65.4961C41.8519 67.3828 43.3462 69 45.2308 69H52.7692C54.5596 69 56 67.558 56 65.7656V3.23456C56 1.45566 54.5596 0.000192551 52.7692 0.000192551C41.6635 0.000192551 22.9654 24.0558 44.0327 40.5511Z" fill="black"/>
                </svg>

                <h4>Еда</h4>
            </div>
            <div class="partner"  data-id="fo">
                <svg width="66" height="75" viewBox="0 0 66 75" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.37103 68.2825C-2.23696 59.4511 -2.07653 45.2096 6.57521 36.4103L37.4773 4.98054C44.006 -1.65989 54.6183 -1.66047 61.1476 4.98054C67.6136 11.5568 67.6214 22.1674 61.1476 28.7514L34.2101 56.1223C29.8118 60.5954 22.6257 60.533 18.302 55.9761C14.1365 51.5859 14.2701 44.6275 18.5159 40.3091L39.6923 18.8001C40.6031 17.8752 42.0954 17.8594 43.0256 18.7648L46.3935 22.043C47.3239 22.9486 47.3396 24.4325 46.429 25.3574L25.2548 46.8643C24.5282 47.6033 24.4835 48.8313 25.1594 49.5438C25.8035 50.2226 26.816 50.2339 27.4705 49.568L54.4081 22.1973C57.2975 19.2585 57.2975 14.4739 54.4065 11.5335C51.5795 8.65846 47.0468 8.65699 44.2186 11.5335L13.3163 42.9631C8.19501 48.1721 8.11605 56.6038 13.1409 61.759C18.1513 66.8995 26.2503 66.906 31.27 61.8009L56.6181 36.0198C57.5281 35.0942 59.0204 35.0775 59.9514 35.9823L63.3216 39.2583C64.2526 40.1631 64.2695 41.647 63.3594 42.5726L38.0112 68.3535C29.2344 77.28 15.0375 77.1742 6.37103 68.2825Z" fill="black"/>
                </svg>

                <h4>Традиции</h4>
            </div>
            <div class="partner"  data-id="five">
                <svg width="64" height="56" viewBox="0 0 64 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M40 32H64V50C64 53.3138 61.3138 56 58 56H6C2.68625 56 0 53.3138 0 50V32H24V34.5C24 35.3284 24.6716 36 25.5 36H38.5C39.3284 36 40 35.3284 40 34.5V32ZM64 18V28H0V18C0 14.6862 2.68625 12 6 12H16V6C16 2.68625 18.6863 0 22 0H42C45.3138 0 48 2.68625 48 6V12H58C61.3138 12 64 14.6862 64 18ZM40 8H24V12H40V8Z" fill="black"/>
                </svg>

                <h4>Работа</h4>
            </div>
        </div>
        <div class="test_more one">
            <div class="blocks_questions rel ">
                <div class="title"><div class="name">Первый квест</div><div class="ball">10 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Второй квест</div><div class="ball">20 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Третий квест</div><div class="ball">25 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
        </div>
        <div class="test_more two">
            <div class="blocks_questions rel ">
                <div class="title"><div class="name">Первый квест</div><div class="ball">10 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Второй квест</div><div class="ball">20 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Третий квест</div><div class="ball">25 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Четвертый квест</div><div class="ball">25 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Пятый квест</div><div class="ball">25 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
        </div>
        <div class="test_more three">
            <div class="blocks_questions rel ">
                <div class="title"><div class="name">Первый квест</div><div class="ball">10 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Второй квест</div><div class="ball">20 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Третий квест</div><div class="ball">25 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Четвертый квест</div><div class="ball">25 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>

        </div>
        <div class="test_more fo">
            <div class="blocks_questions rel ">
                <div class="title"><div class="name">Первый квест</div><div class="ball">10 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>

        </div>
        <div class="test_more five">
            <div class="blocks_questions rel ">
                <div class="title"><div class="name">Первый квест</div><div class="ball">10 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>
            <div class="blocks_questions rel">
                <div class="title"><div class="name">Второй квест</div><div class="ball">20 Баллов</div></div>
                <div class="info">В данном квесте нужно ответить на те то те то вопросы, сделать то или то, и вы получите баллы!
                    <br><a href="test.php">Пройти</a>
                </div>
            </div>

        </div>
    </div>
</div>
<?php
else :echo "<div class='error'>Доступ закрыт</div>";

endif; ?>
<?
include 'footer.php';
?>
